tr_model.h5
- source(https://www.coursera.org/learn/nlp-sequence-models/ungradedLab/zoqcq/lab)
- activation word('activate')
- model_architecture('../Net-Architecture/tr_model.png')
- model summary
    Model: "tr_model"
    _________________________________________________________________
    Layer (type)                 Output Shape              Param #   
    =================================================================
    input_1 (InputLayer)         [(None, 5511, 101)]       0         
    _________________________________________________________________
    conv1d (Conv1D)              (None, 1375, 196)         297136    
    _________________________________________________________________
    batch_normalization (BatchNo (None, 1375, 196)         784       
    _________________________________________________________________
    activation (Activation)      (None, 1375, 196)         0         
    _________________________________________________________________
    dropout (Dropout)            (None, 1375, 196)         0         
    _________________________________________________________________
    gru (GRU)                    (None, 1375, 128)         125184    
    _________________________________________________________________
    dropout_1 (Dropout)          (None, 1375, 128)         0         
    _________________________________________________________________
    batch_normalization_1 (Batch (None, 1375, 128)         512       
    _________________________________________________________________
    gru_1 (GRU)                  (None, 1375, 128)         99072     
    _________________________________________________________________
    dropout_2 (Dropout)          (None, 1375, 128)         0         
    _________________________________________________________________
    batch_normalization_2 (Batch (None, 1375, 128)         512       
    _________________________________________________________________
    dropout_3 (Dropout)          (None, 1375, 128)         0         
    _________________________________________________________________
    time_distributed (TimeDistri (None, 1375, 1)           129       
    =================================================================
    Total params: 523,329
    Trainable params: 522,425
    Non-trainable params: 904